app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.author_id = current_user.id
    @article.save
---
INSERT INTO "articles" ("title", "body", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdffasda"], ["body", "asdfafdsaf"], ["author_id", 2], ["created_at", "2016-04-26 18:46:14.440708"], ["updated_at", "2016-04-26 18:46:14.440708"]]